import random
import pyttsx3
say = pyttsx3.init()
# Список республик, краёв и автономных округов РФ
subjects_rf = [
    # Республики
    "Республика Адыгея", "Республика Алтай", "Республика Башкортостан", 
    "Республика Бурятия", "Республика Дагестан", "Республика Ингушетия",
    "Кабардино-Балкарская Республика", "Республика Калмыкия", "Карачаево-Черкесская Республика",
    "Республика Карелия", "Республика Коми", "Республика Крым",
    "Республика Марий Эл", "Республика Мордовия", "Республика Саха (Якутия)",
    "Республика Северная Осетия - Алания", "Республика Татарстан", "Республика Тыва",
    "Удмуртская Республика", "Республика Хакасия", "Чеченская Республика",
    "Чувашская Республика", "Донецкая республика", "Луганская республика",
    
    # Края
    "Алтайский край", "Забайкальский край", "Камчатский край",
    "Краснодарский край", "Красноярский край", "Пермский край",
    "Приморский край", "Ставропольский край", "Хабаровский край",
    
    # Автономные округа
    "Ненецкий автономный округ", "Ханты-Мансийский автономный округ - Югра",
    "Чукотский автономный округ", "Ямало-Ненецкий автономный округ"
]
deleted = []
random.choice(subjects_rf)
# Примеры использования
i = 0
while True:
    input()
    if len(subjects_rf) == 0:
        subjects_rf = deleted
        deleted.clear()
    subject = random.choice(subjects_rf)
    print(subject)
    print(len(subjects_rf))
    say = pyttsx3.init()
    say.say(subject)
    say.runAndWait()
    if i == 5:
        ch = random.choice(deleted)
        subjects_rf.append(ch)
        deleted.remove(ch)
        i = 0
    subjects_rf.remove(subject)
    deleted.append(subject)
    i += 1